tests/load-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 15
      arrivalRate: 10
      name: Warm up
    - duration: 15
      arrivalRate: 100
      rampTo: 500
      name: Ramp up load
    - duration: 15
      arrivalRate: 1000
      name: Sustained load
  variables:
    product_id:
      - "966092"
      - "994663"
      - "937832"
      - "951990"
      - "980353"

scenarios:
  - name: "Retrieve reviews data"
    flow:
      - get:
          url: "/reviews/?product_id={{ product_id }}"
  - name: "Retrieve meta data"
    flow:
      - get:
          url: "/reviews/meta/?product_id={{ product_id }}"